
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>期中报告 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="立项报告.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">工作环境</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                        <b>1.1.</b>
                    
                    创新实践期末汇报
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Windows快捷键.html">
            
                <a href="Windows快捷键.html">
            
                    
                        <b>1.2.</b>
                    
                    Windows快捷键
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="浏览器插件.html">
            
                <a href="浏览器插件.html">
            
                    
                        <b>1.3.</b>
                    
                    浏览器插件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Git.html">
            
                <a href="Git.html">
            
                    
                        <b>1.4.</b>
                    
                    git
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Github.html">
            
                <a href="Github.html">
            
                    
                        <b>1.5.</b>
                    
                    github
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="wsl及命令行.html">
            
                <a href="wsl及命令行.html">
            
                    
                        <b>1.6.</b>
                    
                    命令行
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">项目</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="Gitbook.html">
            
                <a href="Gitbook.html">
            
                    
                        <b>2.1.</b>
                    
                    Gitbook
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" >
            
                <span>
            
                    
                        <b>2.1.1.</b>
                    
                    部署
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" >
            
                <span>
            
                    
                        <b>2.1.2.</b>
                    
                    插件
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="立项报告.html">
            
                <a href="立项报告.html">
            
                    
                        <b>2.1.3.</b>
                    
                    立项报告
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.1.4" data-path="期中报告.html">
            
                <a href="期中报告.html">
            
                    
                        <b>2.1.4.</b>
                    
                    期中报告
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >期中报告</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x671F;&#x4E2D;&#x62A5;&#x544A;">&#x671F;&#x4E2D;&#x62A5;&#x544A;</h1>
<h3 id="&#x4E00;&#x3001;-gitbook&#x7684;&#x5B89;&#x88C5;&#x4EE5;&#x53CA;git&#x7684;&#x5B89;&#x88C5;">&#x4E00;&#x3001; GitBook&#x7684;&#x5B89;&#x88C5;&#x4EE5;&#x53CA;Git&#x7684;&#x5B89;&#x88C5;</h3>
<p>&#x5B66;&#x4F1A;&#x4E86;Markdown&#x7684;&#x57FA;&#x672C;&#x7684;&#x8BED;&#x6CD5;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x8DC3;&#x8DC3;&#x6B32;&#x8BD5;&#xFF0C;&#x60F3;&#x8981;&#x7528;GitBook&#x6765;&#x7F16;&#x5199;&#x5C5E;&#x4E8E;&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x672C;&#x7535;&#x5B50;&#x4E66;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x7528;&#x8C37;&#x6B4C;&#x641C;&#x7D22;&#x5173;&#x952E;&#x5B57;GitBook&#x5B89;&#x88C5;&#xFF0C;&#x901A;&#x8FC7;&#x67E5;&#x9605;&#x76F8;&#x5173;&#x8D44;&#x6599;&#xFF0C;&#x6211;&#x61C2;&#x5F97;&#x4E86;GitBook&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;Node.js&#x7684;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x56E0;&#x6B64;&#x8981;&#x60F3;&#x5B89;&#x88C5;GitBook&#x5FC5;&#x987B;&#x8981;&#x5148;&#x5B89;&#x88C5;Node.js&#x3002;&#x5B89;&#x88C5;&#x597D;&#x4EE5;&#x540E;&#xFF0C;&#x6559;&#x7A0B;&#x4E0A;&#x8BA9;&#x6211;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#xFF0C;&#x6211;&#x624D;&#x77E5;&#x9053;&#x5B89;&#x88C5;GitBook&#x9700;&#x8981;&#x7528;&#x5230;&#x547D;&#x4EE4;&#x884C;&#xFF0C;&#x6211;&#x4EE5;&#x524D;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x63A5;&#x89E6;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x3002;&#x6211;&#x4E25;&#x683C;&#x5730;&#x6309;&#x7167;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x6559;&#x7A0B;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x5FEB;&#x5C31;&#x9047;&#x5230;&#x4E86;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x6211;&#x8F93;&#x5165;&#x201C;$ npm install -g gitbook-cli&#x201D;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x63D0;&#x793A;&#xFF1A;&#x201C;&apos;$&apos; &#x4E0D;&#x662F;&#x5185;&#x90E8;&#x6216;&#x5916;&#x90E8;&#x547D;&#x4EE4;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x6216;&#x6279;&#x5904;&#x7406;&#x6587;&#x4EF6;&#x3002;&#x201D;&#x6211;&#x6709;&#x4E9B;&#x7EB3;&#x95F7;&#xFF0C;&#x6211;&#x76F4;&#x63A5;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x8FC7;&#x6765;&#x7684;&#x547D;&#x4EE4;&#x600E;&#x4E48;&#x4E5F;&#x4F1A;&#x51FA;&#x9519;&#x3002;&#x6211;&#x6309;&#x7167;&#x7CFB;&#x7EDF;&#x7684;&#x63D0;&#x793A;&#xFF0C;&#x5C1D;&#x8BD5;&#x7740;&#x628A;&#x547D;&#x4EE4;&#x524D;&#x9762;&#x7684;&#x201C;$&#x201D;&#x5220;&#x53BB;&#x518D;&#x8BD5;&#x4E00;&#x6B21;&#xFF0C;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x6211;&#x8FD9;&#x624D;&#x660E;&#x767D;&#x539F;&#x6765;&#x6559;&#x7A0B;&#x91CC;&#x9762;&#x7684;&#x201C;$&#x201D;&#x662F;&#x8868;&#x793A;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x610F;&#x601D;&#x3002;&#x5B89;&#x88C5;&#x5927;&#x6982;&#x7528;&#x4E86;&#x4E00;&#x5206;&#x591A;&#x949F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x5F88;&#x795E;&#x5947;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5E73;&#x65F6;&#x5B89;&#x88C5;&#x522B;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x662F;&#x7528;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x5B89;&#x88C5;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x6B21;&#x53EA;&#x7528;&#x4E86;&#x4E00;&#x884C;&#x77ED;&#x77ED;&#x7684;&#x547D;&#x4EE4;&#x5C31;&#x5B89;&#x88C5;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x611F;&#x53D7;&#x5230;&#x4E86;&#x547D;&#x4EE4;&#x884C;&#x7684;&#x535A;&#x5927;&#x7CBE;&#x6DF1;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x4E4B;&#x540E;&#x8981;&#x7528;&#x5230;GitHub&#xFF0C;&#x9700;&#x8981;&#x5B89;&#x88C5;Git&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5B89;&#x88C5;GitBook&#x7684;&#x65F6;&#x5019;&#x6211;&#x4E00;&#x5E76;&#x5B89;&#x88C5;&#x4E86;Git&#xFF0C;Git&#x5728;&#x56FD;&#x5185;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x6781;&#x6162;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x5230;VPN&#x8FDB;&#x884C;&#x4E0B;&#x8F7D;&#x3002;Git&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x662F;&#x76F8;&#x6BD4;&#x8D77;Windows&#x81EA;&#x5E26;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#x6765;&#x8BF4;&#xFF0C;Git&#x66F4;&#x52A0;&#x5730;&#x65B9;&#x4FBF;&#xFF0C;&#x56E0;&#x4E3A;Windows&#x7684;&#x547D;&#x4EE4;&#x884C;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x5730;&#x8FDB;&#x5165;&#x76EE;&#x5F55;&#x6216;&#x8FD4;&#x56DE;&#x4E0A;&#x4E00;&#x7EA7;&#x76EE;&#x5F55;&#x624D;&#x80FD;&#x5230;&#x8FBE;&#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x800C;Git&#x53EA;&#x9700;&#x8981;&#x5728;&#x60F3;&#x8981;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x53F3;&#x952E;&#x70B9;&#x51FB;&#x7A7A;&#x767D;&#x5904;&#xFF0C;&#x9009;&#x62E9;&#x201C;Git Bash Here&#x201D;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x5B9A;&#x4F4D;&#x5230;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E86;&#xFF0C;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</p>
<p><a href="https://ruby-china.org/topics/34627" target="_blank">https://ruby-china.org/topics/34627</a></p>
<p><a href="https://www.bilibili.com/video/av26479800" target="_blank">https://www.bilibili.com/video/av26479800</a></p>
<h3 id="&#x4E8C;&#x3001;&#x5C1D;&#x8BD5;&#x751F;&#x6210;&#x7B2C;&#x4E00;&#x672C;&#x7535;&#x5B50;&#x4E66;">&#x4E8C;&#x3001;&#x5C1D;&#x8BD5;&#x751F;&#x6210;&#x7B2C;&#x4E00;&#x672C;&#x7535;&#x5B50;&#x4E66;</h3>
<p>GitBook&#x5B89;&#x88C5;&#x597D;&#x4E86;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x5C1D;&#x8BD5;&#x7740;&#x5236;&#x4F5C;&#x7B2C;&#x4E00;&#x672C;&#x7535;&#x5B50;&#x4E66;&#x3002;&#x5728;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x6253;&#x5F00;Git Bash&#xFF0C;&#x8F93;&#x5165;&#x201C;gitbook init&#x201D;&#x5728;&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#x521D;&#x59CB;&#x5316;GitBook&#xFF0C;&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#x4F1A;&#x751F;&#x6210;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;README.md&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;SUMMARY.md&#xFF0C;&#x7ECF;&#x8FC7;&#x67E5;&#x8BE2;&#x76F8;&#x5173;&#x8D44;&#x6599;&#xFF0C;&#x6211;&#x61C2;&#x5F97;&#x4E86;&#x4E66;&#x672C;&#x7684;&#x7B2C;&#x4E00;&#x9875;&#x5185;&#x5BB9;&#x662F;&#x4ECE;&#x6587;&#x4EF6; README.md &#x4E2D;&#x63D0;&#x53D6;&#x7684;&#x3002;&#x800C;&#x6587;&#x4EF6; SUMMARY.md&#x662F;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x4E66;&#x672C;&#x7684;&#x7AE0;&#x8282;&#x548C;&#x5B50;&#x7AE0;&#x8282;&#x7684;&#x7ED3;&#x6784;&#x7684;&#xFF0C;&#x88AB;&#x7528;&#x6765;&#x751F;&#x6210;&#x4E66;&#x672C;&#x5185;&#x5BB9;&#x7684;&#x9884;&#x89C8;&#x8868;&#x3002;&#x5728;&#x6587;&#x4EF6;SUMMARY.md&#x4E2D;&#x52A0;&#x5165;&#x6BCF;&#x4E2A;&#x7AE0;&#x8282;&#x7684;&#x76EE;&#x5F55;&#x5E76;&#x94FE;&#x63A5;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x90E8;&#x7F72;&#x5230;&#x7F51;&#x9875;&#x4E0A;&#x9762;&#x4EE5;&#x540E;&#xFF0C;&#x70B9;&#x51FB;&#x7AE0;&#x8282;&#x7684;&#x540D;&#x79F0;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8DF3;&#x8F6C;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x7AE0;&#x8282;&#x4E86;&#x3002;&#x5C06;&#x6587;&#x6863;&#x5199;&#x597D;&#x4EE5;&#x540E;&#xFF0C;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x201C;gitbook serve&#x201D;&#x5728;&#x672C;&#x5730;&#x751F;&#x6210;&#x7F51;&#x9875;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#x4F1A;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x53EB;&#x201C;_book&#x201D;&#x7684;&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x91CC;&#x9762;&#x7528;&#x6765;&#x5B58;&#x653E;&#x751F;&#x6210;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x5168;&#x90E8;&#x5B8C;&#x6210;&#x4EE5;&#x540E;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x8F93;&#x5165;localhost:4000/&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x751F;&#x6210;&#x7684;&#x7535;&#x5B50;&#x4E66;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x7ECF;&#x8FC7;&#x591A;&#x6B21;&#x6D4B;&#x8BD5;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x5982;&#x679C;Markerdown&#x6587;&#x4EF6;&#x4E2D;&#x63D2;&#x5165;&#x4E86;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x5728;Markdown&#x7F16;&#x8F91;&#x5668;&#x4E2D;&#x53EF;&#x4EE5;&#x6B63;&#x786E;&#x5730;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x56FE;&#x7247;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x751F;&#x6210;&#x7535;&#x5B50;&#x4E66;&#x4EE5;&#x540E;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x91CC;&#x9762;&#x662F;&#x770B;&#x4E0D;&#x5230;&#x8FD9;&#x4E9B;&#x56FE;&#x7247;&#x7684;&#xFF0C;&#x6211;&#x5C1D;&#x8BD5;&#x4E86;&#x597D;&#x51E0;&#x6B21;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x67E5;&#x770B;&#x56FE;&#x7247;&#x3002;&#x5728;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x4E2D;&#x641C;&#x7D22;&#x65E0;&#x679C;&#x540E;&#xFF0C;&#x6211;&#x5C1D;&#x8BD5;&#x7740;&#x81EA;&#x5DF1;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6211;&#x5C06;&#x56FE;&#x7247;&#x94FE;&#x63A5;&#x4ECE;&#x76F8;&#x5BF9;&#x8DEF;&#x5F84;&#x6539;&#x6210;&#x7EDD;&#x5BF9;&#x8DEF;&#x5F84;&#x540E;&#x518D;&#x8FDB;&#x884C;&#x5C1D;&#x8BD5;&#xFF0C;Markdown&#x7F16;&#x8F91;&#x5668;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x56FE;&#x7247;&#xFF0C;&#x4F46;&#x662F;&#x751F;&#x6210;&#x7684;&#x7535;&#x5B50;&#x4E66;&#x4E2D;&#x4F9D;&#x7136;&#x770B;&#x4E0D;&#x5230;&#x56FE;&#x7247;&#x3002;&#x6211;&#x53C8;&#x8BD5;&#x7740;&#x5C06;&#x56FE;&#x7247;&#x5B58;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#xFF0C;&#x7528;&#x76F8;&#x5BF9;&#x8DEF;&#x5F84;&#x53BB;&#x8BBF;&#x95EE;&#xFF0C;&#x8FD9;&#x4E00;&#x6B21;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x751F;&#x6210;&#x7684;&#x7535;&#x5B50;&#x4E66;&#x4E2D;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x770B;&#x5230;&#x56FE;&#x7247;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</p>
<p><a href="https://chrisniael.gitbooks.io/gitbook-documentation/content/index.html" target="_blank">https://chrisniael.gitbooks.io/gitbook-documentation/content/index.html</a></p>
<h3 id="&#x4E09;&#x3001;gitbook&#x7684;&#x90E8;&#x7F72;">&#x4E09;&#x3001;GitBook&#x7684;&#x90E8;&#x7F72;</h3>
<p>&#x5C06;&#x7535;&#x5B50;&#x4E66;&#x5728;&#x672C;&#x5730;&#x751F;&#x6210;&#x4E86;&#x4EE5;&#x540E;&#xFF0C;&#x7ECF;&#x8FC7;&#x9884;&#x89C8;&#xFF0C;&#x548C;&#x6211;&#x6240;&#x9884;&#x671F;&#x7684;&#x6548;&#x679C;&#x76F8;&#x540C;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x8981;&#x628A;&#x7535;&#x5B50;&#x4E66;&#x90E8;&#x7F72;&#x5728;&#x7F51;&#x7AD9;&#x4E0A;&#x9762;&#x4E86;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x9177;&#x7684;&#x90E8;&#x5206;&#x3002;&#x8001;&#x5E08;&#x63D0;&#x4F9B;&#x7684;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x91CC;&#x9762;&#x8BF4;&#xFF0C;&#x5C06;GitBook&#x90E8;&#x7F72;&#x5230;GitHub Pages&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x770B;&#x5230;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x91CC;&#x9762;&#x53EA;&#x6709;&#x77ED;&#x77ED;&#x7684;&#x51E0;&#x884C;&#x64CD;&#x4F5C;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x90E8;&#x7F72;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x7B80;&#x5355;&#x5FEB;&#x6377;&#xFF0C;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x4E4B;&#x524D;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x63A5;&#x89E6;&#x8FC7;Git&#x7684;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x5F88;&#x4E45;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x9996;&#x5148;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x628A;&#x672C;&#x5730;&#x7684;&#x7535;&#x5B50;&#x4E66;&#x4E0A;&#x4F20;&#x5230;GitHub&#x7684;&#x4ED3;&#x5E93;&#x91CC;&#x9762;&#x3002;&#x901A;&#x8FC7;&#x67E5;&#x9605;&#x76F8;&#x5173;&#x8D44;&#x6599;&#xFF0C;&#x8981;&#x5728;GitHub&#x4E0A;&#x9762;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;&#x4ED3;&#x5E93;test1&#xFF0C;&#x4E4B;&#x540E;&#x5728;&#x672C;&#x5730;&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#x628A;&#x7535;&#x5B50;&#x4E66;&#x4E0A;&#x4F20;&#x5230;GitHub&#x4E0A;&#x9762;&#x3002;&#x5728;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x201C;git init&#x201D;&#x4ECE;&#x800C;&#x5728;&#x672C;&#x5730;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;Git&#x4EE3;&#x7801;&#x5E93;&#x3002;&#x4E4B;&#x540E;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x201C;$ git remote add origin <a href="https://github.com/moonyoung1814/test1.git&#x201D;&#x6765;&#x7ED1;&#x5B9A;&#x521A;&#x521A;&#x521B;&#x5EFA;&#x597D;&#x7684;&#x4ED3;&#x5E93;&#x3002;&#x7ED1;&#x5B9A;&#x597D;&#x4ED3;&#x5E93;&#x4EE5;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x672C;&#x5730;&#x7684;&#x9879;&#x76EE;&#x6587;&#x4EF6;&#x5168;&#x90E8;&#x6DFB;&#x52A0;&#x5230;&#x6682;&#x7F13;&#x533A;&#x4E86;&#xFF0C;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x201C;$" target="_blank">https://github.com/moonyoung1814/test1.git&#x201D;&#x6765;&#x7ED1;&#x5B9A;&#x521A;&#x521A;&#x521B;&#x5EFA;&#x597D;&#x7684;&#x4ED3;&#x5E93;&#x3002;&#x7ED1;&#x5B9A;&#x597D;&#x4ED3;&#x5E93;&#x4EE5;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x672C;&#x5730;&#x7684;&#x9879;&#x76EE;&#x6587;&#x4EF6;&#x5168;&#x90E8;&#x6DFB;&#x52A0;&#x5230;&#x6682;&#x7F13;&#x533A;&#x4E86;&#xFF0C;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x201C;$</a> git add .&#x201D;&#x3002;&#x4E0B;&#x4E00;&#x6B65;&#x6DFB;&#x52A0;&#x6CE8;&#x91CA;&#xFF0C;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x201C;$ git commit -m &apos;test&apos;&#x201D;&#x3002;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x6700;&#x5173;&#x952E;&#x7684;&#x4E00;&#x6B65;&#x4E86;&#xFF1A;&#x628A;&#x672C;&#x5730;&#x7684;&#x6587;&#x4EF6;&#x63A8;&#x9001;&#x5230;GitHub&#x4E0A;&#x9762;&#x4E86;&#xFF0C;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#x201C;$ git push -u origin master&#x201D;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8FD9;&#x4E9B;&#x53EA;&#x662F;Git&#x5E38;&#x7528;&#x64CD;&#x4F5C;&#x6307;&#x4EE4;&#x4E2D;&#x7684;&#x5F88;&#x5C0F;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x5F88;&#x591A;Git&#x77E5;&#x8BC6;&#x672C;&#x9879;&#x76EE;&#x4E2D;&#x6682;&#x65F6;&#x8FD8;&#x6CA1;&#x6709;&#x7528;&#x5230;&#xFF0C;&#x6211;&#x4F1A;&#x5728;&#x672C;&#x5B66;&#x671F;&#x7684;&#x5269;&#x4F59;&#x65F6;&#x95F4;&#x91CC;&#x627E;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x6559;&#x7A0B;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x7684;&#x3002;</p>
<p>&#x4E4B;&#x540E;&#x751F;&#x6210;GitHub Pages&#x3002;&#x7ECF;&#x8FC7;&#x67E5;&#x9605;&#x76F8;&#x5173;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x73B0;&#x5728;&#x7684;GitHub Pages&#x4E0D;&#x518D;&#x652F;&#x6301;git-pages&#x5206;&#x652F;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x652F;&#x6301; master &#x5206;&#x652F;&#x7684; /docs &#x76EE;&#x5F55;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5728;&#x751F;&#x6210;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x628A;&#x751F;&#x6210;&#x7684;&#x6587;&#x4EF6;&#x5B58;&#x653E;&#x5728;&#x76EE;&#x5F55;&#x4E0B;&#x9762;&#x7684;docs&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#xFF0C;&#x518D;&#x628A;docs&#x6587;&#x4EF6;&#x5939;&#x4E0A;&#x4F20;&#x5230;&#x4ED3;&#x5E93;&#x91CC;&#x3002;&#x5728;&#x4ED3;&#x5E93;&#x7684;&#x8BBE;&#x7F6E;&#x91CC;&#x9762;&#x627E;&#x5230;GitHub Pages&#x90E8;&#x5206;&#xFF0C;&#x5728;source&#x4E2D;&#x9009;&#x62E9;master branch/docs folder&#x3002;&#x4E4B;&#x540E;&#x7A0D;&#x7B49;&#x7247;&#x523B;&#xFF0C;&#x6253;&#x5F00;&#x7CFB;&#x7EDF;&#x6240;&#x63D0;&#x793A;&#x7684;&#x7F51;&#x5740;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x90E8;&#x7F72;&#x597D;&#x7684;&#x7535;&#x5B50;&#x4E66;&#x4E86;&#x3002;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x4E2D;&#x8BF4;&#x8FD9;&#x662F;&#x53EF;&#x4EE5;&#x7ED1;&#x5B9A;&#x81EA;&#x5B9A;&#x4E49;&#x57DF;&#x540D;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x6CA1;&#x6709;&#x57DF;&#x540D;&#xFF0C;&#x56E0;&#x6B64;&#x8FD8;&#x6CA1;&#x6709;&#x5B66;&#x4E60;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x4F1A;&#x5728;&#x4E4B;&#x540E;&#x7684;&#x65F6;&#x95F4;&#x91CC;&#x641E;&#x4E00;&#x4E2A;&#x57DF;&#x540D;&#x5C1D;&#x8BD5;&#x7ED1;&#x5B9A;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</p>
<p><a href="https://www.jianshu.com/p/3d03ab330df5" target="_blank">https://www.jianshu.com/p/3d03ab330df5</a></p>
<p><a href="https://www.bilibili.com/video/av26479800?t=63" target="_blank">https://www.bilibili.com/video/av26479800?t=63</a></p>
<h3 id="&#x56DB;&#x3001;github&#x56E2;&#x961F;&#x534F;&#x4F5C;">&#x56DB;&#x3001;GitHub&#x56E2;&#x961F;&#x534F;&#x4F5C;</h3>
<p>&#x5728;&#x5B8C;&#x6210;&#x4E86;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x5236;&#x4F5C;&#x548C;&#x90E8;&#x7F72;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x5927;&#x6982;&#x638C;&#x63E1;&#x4E86;GitBook&#x7684;&#x6700;&#x57FA;&#x672C;&#x7684;&#x64CD;&#x4F5C;&#x4E86;&#xFF0C;&#x4E4B;&#x540E;&#x7684;&#x4EFB;&#x52A1;&#x5C31;&#x662F;&#x7F16;&#x5199;&#x7535;&#x5B50;&#x4E66;&#x4E2D;&#x6211;&#x6240;&#x8D1F;&#x8D23;&#x7684;&#x90A3;&#x4E00;&#x90E8;&#x5206;&#x5E76;&#x4E0A;&#x4F20;&#x5230;&#x8001;&#x5E08;&#x7684;&#x4ED3;&#x5E93;&#x4E86;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x6211;&#x5927;&#x6982;&#x61C2;&#x5F97;&#x4E86;GitHub&#x91CC;&#x9762;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x7684;&#x6D41;&#x7A0B;&#xFF1A;&#x5148;&#x628A;&#x8981;&#x534F;&#x4F5C;&#x7684;&#x9879;&#x76EE;fork&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x4ED3;&#x5E93;&#x91CC;&#x9762;&#xFF0C;&#x4E4B;&#x540E;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x4ED3;&#x5E93;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x4FEE;&#x6539;&#x597D;&#x4EE5;&#x540E;&#x901A;&#x8FC7;pull request&#x628A;&#x6539;&#x52A8;&#x63D0;&#x4EA4;&#x7ED9;&#x9879;&#x76EE;&#x7684;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x5BA1;&#x6838;&#x901A;&#x8FC7;&#x4EE5;&#x540E;&#x9879;&#x76EE;&#x5C31;&#x88AB;&#x6210;&#x529F;&#x4FEE;&#x6539;&#x4E86;&#x3002;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x770B;&#x61C2;&#x8001;&#x5E08;&#x63D0;&#x4F9B;&#x7684;&#x534F;&#x4F5C;&#x6D41;&#x7A0B;&#x89C6;&#x9891;&#x6559;&#x7A0B;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x5355;&#x72EC;&#x53BB;&#x7F51;&#x4E0A;&#x5BFB;&#x627E;&#x6559;&#x7A0B;&#x3002;&#x6839;&#x636E;&#x6559;&#x7A0B;&#xFF0C;&#x6211;&#x4E0B;&#x8F7D;&#x4E86;&#x53EB;GitHub Desktop&#x7684;&#x4E00;&#x4E2A;&#x53EF;&#x89C6;&#x5316;&#x7A0B;&#x5E8F;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x91CC;&#x9762;&#x4E5F;&#x53EF;&#x4EE5;&#x5BF9;GitHub&#x4ED3;&#x5E93;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x76F8;&#x6BD4;&#x8D77;&#x547D;&#x4EE4;&#x884C;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x7A0B;&#x5E8F;</p>
<p>&#x66F4;&#x52A0;&#x76F4;&#x89C2;&#xFF0C;&#x5BF9;&#x50CF;&#x6211;&#x8FD9;&#x6837;&#x7684;&#x65B0;&#x624B;&#x6765;&#x8BF4;&#x975E;&#x5E38;&#x53CB;&#x597D;&#x3002;&#x6211;&#x628A;&#x8001;&#x5E08;&#x7684;&#x9879;&#x76EE;fork&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x4ED3;&#x5E93;&#xFF0C;&#x4E0B;&#x8F7D;&#x5230;&#x672C;&#x5730;&#xFF0C;&#x7F16;&#x5199;&#x4E86;&#x6211;&#x8D1F;&#x8D23;&#x7684;&#x7AE0;&#x8282;&#xFF0C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x786E;&#x5B9E;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x80FD;&#x591F;&#x5F88;&#x76F4;&#x89C2;&#x7684;&#x770B;&#x5230;&#x6211;&#x5BF9;&#x4E8E;&#x9879;&#x76EE;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x63D0;&#x4EA4;&#x4E5F;&#x5F88;&#x4FBF;&#x6377;&#x3002;&#x5728;&#x4E4B;&#x540E;&#x7684;&#x5B66;&#x4E60;&#x4E2D;&#x6211;&#x4F1A;&#x5B66;&#x4E60;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x884C;&#x6765;&#x5B9E;&#x73B0;&#x4E0A;&#x8FF0;&#x64CD;&#x4F5C;&#x3002;&#x6700;&#x540E;pull request&#xFF0C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x975E;&#x5E38;&#x7684;&#x987A;&#x5229;&#x3002;</p>
<p>&#x5728;&#x67E5;&#x9605;&#x8D44;&#x6599;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x5F88;&#x591A;&#x6559;&#x7A0B;&#x91CC;&#x9762;&#x90FD;&#x63D0;&#x5230;&#x4E86;&#x5206;&#x652F;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x6211;&#x4E0D;&#x61C2;&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x652F;&#xFF0C;&#x5B83;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x4E13;&#x95E8;&#x8C37;&#x6B4C;&#x4E86;&#x4E00;&#x4E0B;GitHub&#x7684;&#x5206;&#x652F;&#x3002;&#x901A;&#x8FC7;&#x76F8;&#x5173;&#x6587;&#x732E;&#xFF0C;&#x6211;&#x660E;&#x767D;&#x4E86;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x90FD;&#x5E94;&#x8BE5;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x4E14;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x5206;&#x652F;&#xFF0C;&#x6240;&#x6709;&#x63D0;&#x4F9B;&#x7ED9;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x7684;&#x6B63;&#x5F0F;&#x7248;&#x672C;&#xFF0C;&#x90FD;&#x5728;&#x8FD9;&#x4E2A;&#x4E3B;&#x5206;&#x652F;&#x4E0A;&#x53D1;&#x5E03;&#x3002;&#x4E3B;&#x5206;&#x652F;&#x53EA;&#x7528;&#x6765;&#x5206;&#x5E03;&#x91CD;&#x5927;&#x7248;&#x672C;&#xFF0C;&#x65E5;&#x5E38;&#x5F00;&#x53D1;&#x4E0D;&#x5E94;&#x8BE5;&#x76F4;&#x63A5;&#x5728;&#x4E3B;&#x5206;&#x652F;&#x4E0A;&#x9762;&#x8FDB;&#x884C;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x5728;&#x53E6;&#x4E00;&#x6761;&#x5206;&#x652F;&#x4E0A;&#x5B8C;&#x6210;&#xFF0C;&#x53EB;develop&#xFF0C;&#x8FD9;&#x4E2A;&#x5206;&#x652F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x6700;&#x65B0;&#x9694;&#x591C;&#x7248;&#x672C;&#xFF08;nightly&#xFF09;&#x3002;&#x5982;&#x679C;&#x60F3;&#x6B63;&#x5F0F;&#x5BF9;&#x5916;&#x53D1;&#x5E03;&#xFF0C;&#x5C31;&#x5728;Master&#x5206;&#x652F;&#x4E0A;&#xFF0C;&#x5BF9;Develop&#x5206;&#x652F;&#x8FDB;&#x884C;&quot;&#x5408;&#x5E76;&quot;&#xFF08;merge&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x9664;&#x4E86;&#x5E38;&#x8BBE;&#x5206;&#x652F;&#x4EE5;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4E34;&#x65F6;&#x6027;&#x5206;&#x652F;&#xFF0C;&#x7528;&#x4E8E;&#x5E94;&#x5BF9;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x76EE;&#x7684;&#x7684;&#x7248;&#x672C;&#x5F00;&#x53D1;&#x3002;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF0C;&#x5206;&#x652F;&#x529F;&#x80FD;&#x5BF9;&#x4E8E;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x7248;&#x672C;&#x5E93;&#x7684;&#x6F14;&#x8FDB;&#x4FDD;&#x6301;&#x7B80;&#x6D01;&#xFF0C;&#x4E3B;&#x5E72;&#x6E05;&#x6670;&#xFF0C;&#x5404;&#x4E2A;&#x5206;&#x652F;&#x5404;&#x53F8;&#x5176;&#x804C;&#x3001;&#x4E95;&#x4E95;&#x6709;&#x6761;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</p>
<p><a href="https://segmentfault.com/q/1010000006216219" target="_blank">https://segmentfault.com/q/1010000006216219</a></p>
<p><a href="http://www.ruanyifeng.com/blog/2012/07/git.html" target="_blank">http://www.ruanyifeng.com/blog/2012/07/git.html</a></p>
<p><a href="https://blog.csdn.net/zhongzunfa/article/details/80344585" target="_blank">https://blog.csdn.net/zhongzunfa/article/details/80344585</a></p>
<p><a href="https://learnku.com/articles/30125" target="_blank">https://learnku.com/articles/30125</a></p>
<h3 id="&#x4E94;&#x3001;&#x540E;&#x7EED;&#x5DE5;&#x4F5C;">&#x4E94;&#x3001;&#x540E;&#x7EED;&#x5DE5;&#x4F5C;</h3>
<p>&#x524D;&#x534A;&#x4E2A;&#x5B66;&#x671F;&#x7684;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x6211;&#x4E86;&#x89E3;&#x4E86;GitBook&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#xFF0C;&#x61C2;&#x5F97;&#x4E86;&#x5982;&#x4F55;&#x5B89;&#x88C5;&#x3001;&#x914D;&#x7F6E;&#x3001;&#x90E8;&#x7F72;&#x7535;&#x5B50;&#x4E66;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;GItHub&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x8BA4;&#x8BC6;&#x548C;&#x4E86;&#x89E3;&#x3002;&#x5728;&#x540E;&#x534A;&#x4E2A;&#x5B66;&#x671F;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x628A;&#x91CD;&#x70B9;&#x653E;&#x5728;GitBook&#x7684;&#x63D2;&#x4EF6;&#x4E0A;&#xFF0C;&#x5305;&#x62EC;&#x5BF9;&#x5404;&#x79CD;&#x63D2;&#x4EF6;&#x7684;&#x8BD5;&#x7528;&#x5E76;&#x7F16;&#x5199;&#x62A5;&#x544A;&#x548C;&#x5B66;&#x4E60;&#x63D2;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="立项报告.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 立项报告">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"期中报告","level":"2.1.4","depth":2,"previous":{"title":"立项报告","level":"2.1.3","depth":2,"path":"立项报告.md","ref":"立项报告.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":true},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"期中报告.md","mtime":"2019-11-10T13:51:32.489Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-01T05:11:21.505Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

