
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>立项报告 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="期中报告.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">工作环境</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                        <b>1.1.</b>
                    
                    创新实践期末汇报
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Windows快捷键.html">
            
                <a href="Windows快捷键.html">
            
                    
                        <b>1.2.</b>
                    
                    Windows快捷键
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="浏览器插件.html">
            
                <a href="浏览器插件.html">
            
                    
                        <b>1.3.</b>
                    
                    浏览器插件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Git.html">
            
                <a href="Git.html">
            
                    
                        <b>1.4.</b>
                    
                    git
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Github.html">
            
                <a href="Github.html">
            
                    
                        <b>1.5.</b>
                    
                    github
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="wsl及命令行.html">
            
                <a href="wsl及命令行.html">
            
                    
                        <b>1.6.</b>
                    
                    命令行
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">项目</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="Gitbook.html">
            
                <a href="Gitbook.html">
            
                    
                        <b>2.1.</b>
                    
                    Gitbook
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" >
            
                <span>
            
                    
                        <b>2.1.1.</b>
                    
                    部署
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" >
            
                <span>
            
                    
                        <b>2.1.2.</b>
                    
                    插件
            
                </span>
            

            
        </li>
    
        <li class="chapter active" data-level="2.1.3" data-path="立项报告.html">
            
                <a href="立项报告.html">
            
                    
                        <b>2.1.3.</b>
                    
                    立项报告
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.4" data-path="期中报告.html">
            
                <a href="期中报告.html">
            
                    
                        <b>2.1.4.</b>
                    
                    期中报告
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >立项报告</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7ACB;&#x9879;&#x62A5;&#x544A;">&#x7ACB;&#x9879;&#x62A5;&#x544A;</h1>
<h3 id="1&#x3001;&#x9879;&#x76EE;&#x80CC;&#x666F;&#x4ECB;&#x7ECD;">1&#x3001;&#x9879;&#x76EE;&#x80CC;&#x666F;&#x4ECB;&#x7ECD;</h3>
<p>GitBook&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;Node.js&#x7684;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x6377;&#x5730;&#x5236;&#x4F5C;&#x6587;&#x6863;&#x4E0E;&#x7535;&#x5B50;&#x4E66;&#xFF0C;&#x652F;&#x6301;Markdown&#x548C;AsciiDoc&#x4E24;&#x79CD;&#x8BED;&#x6CD5;&#x683C;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x8F93;&#x51FA; HTML&#x3001;PDF&#x3001;eBook &#x7B49;&#x683C;&#x5F0F;&#x7684;&#x7535;&#x5B50;&#x4E66;&#x3002;GitBook&#x5177;&#x6709;&#x4E30;&#x5BCC;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x4F7F;&#x7535;&#x5B50;&#x4E66;&#x66F4;&#x52A0;&#x7CBE;&#x7F8E;&#x4E14;&#x5177;&#x6709;&#x66F4;&#x591A;&#x529F;&#x80FD;&#xFF0C;GitBook&#x5B9E;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x79CD;&#x9759;&#x6001;&#x7AD9;&#x70B9;&#x751F;&#x6210;&#x5668;&#x3002;GitBook&#x4E0E;Markdown&#x548C;Git&#x606F;&#x606F;&#x76F8;&#x5173;&#xFF0C;&#x5229;&#x7528;Markdown&#x5DE5;&#x5177;&#x7F16;&#x5199;&#x6587;&#x6863;&#xFF1B;&#x4F7F;&#x7528;GitBook&#x5BF9;&#x6587;&#x6863;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x9884;&#x89C8;&#x3001;&#x5236;&#x4F5C;&#x3001;&#x90E8;&#x7F72;&#x7535;&#x5B50;&#x4E66;&#xFF1B;&#x540C;&#x65F6;&#x901A;&#x8FC7;Git&#x7BA1;&#x7406;&#x4E66;&#x7C4D;&#x5185;&#x5BB9;&#x7684;&#x53D8;&#x66F4;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x6258;&#x7BA1;&#x5230;&#x4E91;&#x7AEF;&#xFF08;&#x4F8B;&#x5982;GitHub&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x591A;&#x4EBA;&#x534F;&#x4F5C;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x8D77;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;Word&#xFF0C;GitBook&#x6709;&#x7740;&#x66F4;&#x591A;&#x7684;&#x4F18;&#x70B9;&#x3002;Word&#x5B58;&#x5728;&#x7740;&#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x4FDD;&#x5B58;&#x3001;&#x8F6F;&#x4EF6;&#x4E0D;&#x517C;&#x5BB9;&#x3001;&#x683C;&#x5F0F;&#x4E0D;&#x517C;&#x5BB9;&#x3001;&#x96BE;&#x4EE5;&#x8FDB;&#x884C;&#x7248;&#x672C;&#x63A7;&#x5236;&#x3001;&#x96BE;&#x4EE5;&#x5B9E;&#x65F6;&#x5206;&#x4EAB;&#x9884;&#x89C8;&#x3001;&#x96BE;&#x4EE5;&#x591A;&#x4EBA;&#x534F;&#x4F5C;&#x7B49;&#x77ED;&#x677F;&#xFF0C;&#x800C;GitBook&#x8BED;&#x6CD5;&#x7B80;&#x5355;&#x3001;&#x517C;&#x5BB9;&#x6027;&#x5F3A;&#x3001;&#x5BFC;&#x51FA;&#x65B9;&#x4FBF;&#x3001;&#x4FBF;&#x4E8E;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x5177;&#x6709;&#x4F18;&#x8D8A;&#x6027;&#x3002;</p>
<p>&#x672C;&#x9879;&#x76EE;&#x8981;&#x7F16;&#x5199;&#x4E00;&#x672C;&#x5173;&#x4E8E;GitBook&#x6307;&#x5357;&#x7684;&#x7535;&#x5B50;&#x4E66;&#xFF0C;&#x91CC;&#x9762;&#x5305;&#x62EC;&#x672C;&#x4E66;&#x8BF4;&#x660E;&#x3001;&#x6309;&#x7167;&#x3001;&#x914D;&#x7F6E;&#x3001;&#x90E8;&#x7F72;&#x3001;&#x63D2;&#x4EF6;&#x7B49;&#x7AE0;&#x8282;&#xFF0C;&#x8BE6;&#x7EC6;&#x5730;&#x5411;&#x96F6;&#x57FA;&#x7840;&#x7684;&#x8BFB;&#x8005;&#x4ECB;&#x7ECD;GitBook&#x3002;</p>
<h3 id="2&#x3001;&#x9879;&#x76EE;&#x76EE;&#x6807;&#x4ECB;&#x7ECD;">2&#x3001;&#x9879;&#x76EE;&#x76EE;&#x6807;&#x4ECB;&#x7ECD;</h3>
<p>&#x5B66;&#x4E60;GitBook&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#xFF0C;&#x901A;&#x8FC7;&#x67E5;&#x9605;&#x7F51;&#x4E0A;&#x7684;&#x73B0;&#x6709;&#x8D44;&#x6599;&#xFF0C;&#x5C06;&#x7F51;&#x4E0A;&#x7684;&#x5404;&#x7C7B;GitBook&#x6307;&#x5357;&#x8FDB;&#x884C;&#x6C47;&#x603B;&#xFF0C;&#x7F16;&#x5199;&#x4E00;&#x672C;&#x4ECB;&#x7ECD;GitBook&#x76F8;&#x5173;&#x7528;&#x6CD5;&#x7684;&#x5F00;&#x6E90;&#x7684;&#x7535;&#x5B50;&#x4E66;&#xFF1B;&#x5B66;&#x4E60;&#x5728;GitBook&#x4E2D;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x63D2;&#x4EF6;&#xFF0C;&#x5E76;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x6574;&#x7406;&#xFF0C;&#x7F16;&#x5199;&#x63D2;&#x4EF6;&#x62A5;&#x544A;&#xFF1B;&#x5B66;&#x4E60;&#x63D2;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x5BF9;GitBook&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x6DF1;&#x5165;&#x6269;&#x5C55;&#x7814;&#x7A76;&#x3002;&#x5C06;&#x6700;&#x7EC8;&#x5B8C;&#x6210;&#x7684;&#x7535;&#x5B50;&#x4E66;&#x53D1;&#x5E03;&#x5728;GitHub&#x4E0A;&#x3002;</p>
<h3 id="3&#x3001;&#x6211;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x7406;&#x89E3;&#x4EE5;&#x53CA;&#x6211;&#x9002;&#x5408;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x539F;&#x56E0;">3&#x3001;&#x6211;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x7406;&#x89E3;&#x4EE5;&#x53CA;&#x6211;&#x9002;&#x5408;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x539F;&#x56E0;</h3>
<p>&#x672C;&#x9879;&#x76EE;&#x4E0E;Git&#x606F;&#x606F;&#x76F8;&#x5173;&#xFF0C;&#x8981;&#x6C42;&#x7EC4;&#x5458;&#x5728;GitHub&#x4E0A;&#x8FDB;&#x884C;&#x591A;&#x4EBA;&#x534F;&#x4F5C;&#x3002;&#x6211;&#x5728;&#x4E4B;&#x524D;&#x5927;&#x4E00;&#x7684;&#x5B66;&#x4E60;&#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x63A5;&#x89E6;&#x8FC7;GitHub&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x65E9;&#x5DF2;&#x542C;&#x8BF4;&#x8FC7;&#x5B83;&#x7684;&#x5927;&#x540D;&#xFF0C;&#x77E5;&#x9053;&#x5B83;&#x662F;&#x5168;&#x7403;&#x6700;&#x5927;&#x7684;&#x793E;&#x4EA4;&#x7F16;&#x7A0B;&#x53CA;&#x4EE3;&#x7801;&#x6258;&#x7BA1;&#x7F51;&#x7AD9;&#x3002;&#x5728;&#x5B66;&#x671F;&#x521D;&#x8001;&#x5E08;&#x7B80;&#x5355;&#x5730;&#x4ECB;&#x7ECD;&#x4E86;GitHub&#x540E;&#xFF0C;&#x6211;&#x4E0A;&#x53BB;&#x901B;&#x4E86;&#x4E00;&#x5708;&#xFF0C;&#x5728;&#x91CC;&#x9762;&#x53D1;&#x73B0;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x610F;&#x8BC6;&#x5230;&#x5982;&#x679C;&#x80FD;&#x719F;&#x7EC3;&#x5730;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x5C31;&#x80FD;&#x4ECE;&#x522B;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x5F97;&#x5230;&#x542F;&#x53D1;&#xFF0C;&#x8FD9;&#x5BF9;&#x6211;&#x4ECA;&#x540E;&#x7684;&#x5B66;&#x4E60;&#x662F;&#x975E;&#x5E38;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x6211;&#x6709;&#x8F83;&#x5F3A;&#x7684;&#x81EA;&#x5B66;&#x80FD;&#x529B;&#xFF0C;&#x6211;&#x901A;&#x8FC7;&#x67E5;&#x9605;&#x7F51;&#x4E0A;&#x7684;&#x8D44;&#x6599;&#x53CA;&#x6587;&#x732E;&#x5C31;&#x53EF;&#x4EE5;&#x638C;&#x63E1;&#x672C;&#x9879;&#x76EE;&#x8981;&#x6C42;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#xFF0C;&#x6B63;&#x597D;&#x501F;&#x6B64;&#x673A;&#x4F1A;&#x6211;&#x53EF;&#x4EE5;&#x5BF9;GitHub&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x6DF1;&#x5165;&#x7684;&#x4E86;&#x89E3;&#x548C;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x6211;&#x5BF9;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x975E;&#x5E38;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x5728;&#x7B2C;&#x4E00;&#x8282;&#x8BFE;&#x4E0A;&#xFF0C;&#x8001;&#x5E08;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E86;GitBook&#x4F5C;&#x4E3A;&#x8BFE;&#x4EF6;&#x6765;&#x4E0A;&#x8BFE;&#x7684;&#x3002;&#x5C06;&#x7535;&#x5B50;&#x4E66;&#x90E8;&#x7F72;&#x5728;&#x7F51;&#x7AD9;&#x4E0A;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x8F93;&#x5165;&#x7F51;&#x5740;&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7535;&#x5B50;&#x4E66;&#x4E86;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x975E;&#x5E38;&#x9177;&#xFF0C;&#x800C;&#x4E14;&#x975E;&#x5E38;&#x7684;&#x65B9;&#x4FBF;&#x3002;&#x5728;&#x73B0;&#x5B9E;&#x4E2D;&#x6211;&#x80FD;&#x7ECF;&#x5E38;&#x80FD;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x72B6;&#x51B5;&#xFF1A;&#x6709;&#x7684;&#x540C;&#x5B66;&#x6216;&#x8005;&#x8001;&#x5E08;&#x5728;&#x8BFE;&#x5802;&#x4E0A;&#x9700;&#x8981;&#x7528;&#x5230;&#x8BFE;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;Word&#x6216;PPT&#x5FD8;&#x8BB0;&#x62F7;&#x8D1D;&#x4E86;&#x6216;&#x8005;&#x6587;&#x4EF6;&#x635F;&#x574F;&#x800C;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x6253;&#x5F00;&#xFF0C;&#x8FD9;&#x975E;&#x5E38;&#x5730;&#x5C34;&#x5C2C;&#xFF0C;&#x800C;GitBook&#x5C31;&#x4E0D;&#x4F1A;&#x4E86;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x7F51;&#x7EDC;&#xFF0C;&#x968F;&#x65F6;&#x968F;&#x5730;&#x90FD;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x7535;&#x5B50;&#x4E66;&#x3002;&#x8FD9;&#x6781;&#x5927;&#x5730;&#x6FC0;&#x53D1;&#x4E86;&#x6211;&#x5BF9;GitBook&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x6211;&#x4E5F;&#x975E;&#x5E38;&#x5E0C;&#x671B;&#x6709;&#x4E00;&#x5929;&#x6211;&#x53EF;&#x4EE5;&#x5728;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x7AD9;&#x91CC;&#x9762;&#x90E8;&#x7F72;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x672C;&#x7535;&#x5B50;&#x4E66;&#x3002;&#x5174;&#x8DA3;&#x662F;&#x6700;&#x597D;&#x7684;&#x8001;&#x5E08;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x5728;&#x5174;&#x8DA3;&#x7684;&#x9A71;&#x52A8;&#x4E0B;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x9AD8;&#x8D28;&#x91CF;&#x5730;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x3002;</p>
<h3 id="4&#x3001;&#x6280;&#x672F;&#x5173;&#x952E;&#x70B9;">4&#x3001;&#x6280;&#x672F;&#x5173;&#x952E;&#x70B9;</h3>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x672C;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x5BF9;Markdown&#x7684;&#x7F16;&#x5199;&#x662F;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x8BED;&#x6CD5;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x7B80;&#x5355;&#x5B66;&#x4E60;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x6587;&#x6863;&#x5199;&#x7684;&#x5F88;&#x597D;&#x4E86;&#x3002;&#x5173;&#x952E;&#x7684;&#x5730;&#x65B9;&#x662F;GitBook&#x7684;&#x90E8;&#x7F72;&#x3001;&#x63D2;&#x4EF6;&#x7684;&#x4F7F;&#x7528;&#x548C;&#x5F00;&#x53D1;&#x4EE5;&#x53CA;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x90E8;&#x5206;&#x3002;GitBook&#x5728;&#x90E8;&#x7F72;&#x5230;GitHub Pages&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x628A;&#x7535;&#x5B50;&#x4E66;&#x540C;&#x6B65;&#x5230;&#x4E91;&#x7AEF;&#x7684;&#x4ED3;&#x5E93;&#xFF0C;&#x8981;&#x7528;&#x5230;git&#x7684;&#x76F8;&#x5173;&#x547D;&#x4EE4;&#x548C;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x662F;&#x6211;&#x4EE5;&#x524D;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x6211;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x5B66;&#x4E60;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E5F;&#x662F;&#x90E8;&#x7F72;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x6B65;&#x3002;GitBook&#x7684;&#x63D2;&#x4EF6;&#x5F88;&#x591A;&#x5F88;&#x7E41;&#x6742;&#xFF0C;&#x529F;&#x80FD;&#x4E5F;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x6D4B;&#x8BD5;&#x4F7F;&#x7528;&#x4E5F;&#x662F;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x5173;&#x952E;&#x70B9;&#x3002;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x662F;GitHub&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x90E8;&#x5206;&#xFF0C;&#x8981;&#x60F3;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x5C0F;&#x7EC4;&#x6210;&#x5458;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4ED3;&#x5E93;&#x7684;fork&#x64CD;&#x4F5C;&#x662F;GitHub&#x4E2D;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x7684;&#x91CD;&#x8981;&#x65B9;&#x5F0F;&#xFF0C;&#x5BF9;&#x5176;&#x719F;&#x7EC3;&#x8FD0;&#x7528;&#x662F;&#x975E;&#x5E38;&#x5173;&#x952E;&#x7684;&#xFF0C;&#x6211;&#x4E4B;&#x524D;&#x4E5F;&#x6CA1;&#x6709;&#x63A5;&#x89E6;&#x8FC7;&#xFF0C;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x3002;</p>
<h3 id="5&#x3001;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x4E0E;&#x5B66;&#x4E60;&#x8BA1;&#x5212;">5&#x3001;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x4E0E;&#x5B66;&#x4E60;&#x8BA1;&#x5212;</h3>
<pre><code>1.&#x5728;&#x786E;&#x5B9A;&#x9879;&#x76EE;&#x7684;&#x4E4B;&#x540E;&#x4E24;&#x4E2A;&#x661F;&#x671F;&#x5B66;&#x4E60;Markdown&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#xFF0C;&#x8BD5;&#x7740;&#x7F16;&#x5199;&#x51FA;&#x81EA;&#x5DF1;&#x7684;Markdown&#x6587;&#x6863;&#x3002;
2.&#x4E4B;&#x540E;&#x4E0B;&#x8F7D;git&#xFF0C;&#x5B89;&#x88C5;GitBook&#xFF0C;&#x5B66;&#x4E60;GitBook&#x7684;&#x76F8;&#x5173;&#x64CD;&#x4F5C;&#xFF0C;&#x5C1D;&#x8BD5;&#x5728;&#x672C;&#x5730;&#x751F;&#x6210;&#x7535;&#x5B50;&#x4E66;&#x3002;
3.&#x5B66;&#x4E60;&#x5728;GitHub Pages&#x4E0A;&#x9762;&#x90E8;&#x7F72;&#x7535;&#x5B50;&#x4E66;&#x3002;
4.&#x5728;&#x5B66;&#x4F1A;&#x4E86;GitBook&#x7684;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#x540E;&#xFF0C;&#x53C2;&#x8003;&#x7F51;&#x4E0A;&#x7684;&#x73B0;&#x6709;&#x8D44;&#x6599;&#x5E76;&#x7F16;&#x5199;GitBook&#x6307;&#x5357;&#x7535;&#x5B50;&#x4E66;&#x4E2D;&#x6211;&#x6240;&#x8D1F;&#x8D23;&#x7684;&#x90E8;&#x5206;&#x3002;
5.&#x5B66;&#x4E60;GitHub&#x91CC;&#x9762;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x6D41;&#x7A0B;&#xFF0C;&#x628A;&#x7F16;&#x5199;&#x597D;&#x7684;&#x90E8;&#x5206;&#x4E0A;&#x4F20;&#x3002;&#x5927;&#x6982;&#x5728;&#x671F;&#x4E2D;&#x5DE6;&#x53F3;&#x5B8C;&#x6210;&#x4E0A;&#x8FF0;&#x5185;&#x5BB9;&#x3002;
6.&#x671F;&#x4E2D;&#x4E4B;&#x540E;&#x5C06;&#x628A;&#x91CD;&#x70B9;&#x653E;&#x5728;GitBook&#x7684;&#x63D2;&#x4EF6;&#x4E0A;&#x9762;&#x3002;&#x524D;&#x4E24;&#x5468;&#x8BD5;&#x7740;&#x4E0B;&#x8F7D;&#x63D2;&#x4EF6;&#x5E76;&#x628A;&#x63D2;&#x4EF6;&#x7528;&#x5728;&#x7535;&#x5B50;&#x4E66;&#x91CC;&#x9762;&#x3002;
7.&#x7F16;&#x5199;&#x63D2;&#x4EF6;&#x62A5;&#x544A;&#xFF0C;&#x5E76;&#x4E0A;&#x4F20;&#x3002;
8.&#x5B66;&#x4E60;&#x63D2;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x3002;
</code></pre>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="期中报告.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 期中报告">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"立项报告","level":"2.1.3","depth":2,"next":{"title":"期中报告","level":"2.1.4","depth":2,"path":"期中报告.md","ref":"期中报告.md","articles":[]},"previous":{"title":"插件","level":"2.1.2","depth":2,"ref":"","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":true},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"立项报告.md","mtime":"2019-10-30T11:58:08.723Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-01T05:11:21.505Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

